---
kind: method
id: M:Autodesk.Revit.DB.FilterRule.GetRuleParameter
source: html/f30e47b9-df2f-8baa-ffeb-b957c8810156.htm
---
# Autodesk.Revit.DB.FilterRule.GetRuleParameter Method

Returns the ElementId of the parameter associated to this FilterRule if there is one,
 or invalidElementId if there is no associated parameter.

## Syntax (C#)
```csharp
public ElementId GetRuleParameter()
```

## Returns
The parameter id if there is an associated parameter, or invalidElementId if not.